<?php
    // Вывод подсказки
    print("Цена билета в рублях: ");
    $n = intval(fgets(STDIN));  // Ввод цены билета
    $x = 0;  // количество жетонов по 4
    $y = 0;  // количество жетонов по 7
    $n_orig = $n; // Запомнить введённое значение для вывода
    // Перебираем количество жетонов по 7 от максимума до 0
    $max_y = intdiv($n, 7);
    for ($y = $max_y; $y >= 0; $y--)
    {
        $remainder = $n - 7 * $y;  // Сумму разменяли на жетоны по 7
        if ($remainder % 4 == 0)  // Остаток разменяли на жетоны по 4
        {
            // Если удалось разменять всю сумму, конец цикла    
            $x = intdiv($remainder, 4);  
            //  Вывод найденного решения на экран
            print("Введённую цену ". $n_orig . "можно разменять на жетоны:\r\n");
            print("Количество жетонов по 4 рубля: " . $x . "\r\n");
            print("Количество жетонов по 7 рублей: " . $y . "\r\n");
            break;
        } 
    }
    // Решений для указанной суммы нет
    if (($x <= 0) && ($y <= 0))
    {
        print("Введённую цену " . $n_orig . " нельзя разменять на жетоны\r\n");
    }
?>