<?php
    print("Цена билета в рублях: ");
    $n = intval(fgets(STDIN));  // Ввод цены билета
    $x = 0;  // количество жетонов по 4
    $y = intdiv($n, 7);  // начинаем с максимального количества жетонов по 7
    $found = false;  // флаг, нашли ли мы решение
    // Перебираем количество жетонов по 7 от максимума до 0 пока
    // пока не найдётся решение или не закончатся жетоны по 7
    while (($y >= 0) && (!$found))
    {
        $remainder = $n - 7 * $y;  // Сумму разменяли на жетоны по 7
        if ($remainder % 4 == 0)  // Остаток разменяли на жетоны по 4
        {
            $x = intdiv($remainder, 4); // Если удалось разменять всю сумму, конец цикла
            //  Вывод найденного решения на экран
            print("Введённую цену " . $n . " можно разменять на жетоны:\r\n");
            print("Количество жетонов по 4 рубля: " . $x . "\r\n");
            print("Количество жетонов по 7 рублей: " . $y . "\r\n");
            // Флаговую переменную переменную установили в истинное значение,
            // так как нашли решение
            $found = true;
        }    
        $y -= 1;  // уменьшаем количество жетонов по 7
    }
    // Решений для указанной суммы нет
    if (!$found)
    {
        print("Введённую цену " . $n . " нельзя разменять на жетоны\r\n");
    } 
?>